Repository: 84000/data-translation-memory
Catalog: toh190-v3.tmx
Source language: bo
Languages: en

source: །མ་འོངས་པ་གང་ལགས་པ་དེ་དག་ཀྱང་ད་དུང་མ་ཕྱིན་པ་སྟེ།
en: Those of the future have not yet come about;

source: དེ་དག་ཀྱང་ཟད་པར་བགྱིར་མི་ནུས་སོ།
en: thus, they also cannot be exhausted.

source: །ད་ལྟར་བྱུང་བ་གང་ལགས་པ་དེ་དག་ནི་མི་གནས་པ་སྟེ།
en: Those in the present do not remain;

source: དེ་དག་ཀྱང་ཟད་པར་བགྱིར་མི་ནུས་སོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: so they, too, cannot be exhausted.”

source: རིགས་ཀྱི་བུ་བདག་གིས་ནི་འདྲི་བ་ཐམས་ཅད་ཀྱི་ལན་གདབ་པར་མི་ནུས་པའི་སྟེང་དུ་བསོད་སྙོམས་ཀྱི་དུས་ལ་བབ་སྟེ་བདག་གི་དུས་ཡོལ་དུ་འོང་གིས་བསོད་སྙོམས་ལ་འགྲོའོ།
en: “Noble son,” replied Subhūti, “I am incapable of answering all these questions; and, moreover, it is time for me to go for alms. Thus, I am going for alms, before I run out of time.”

source: །དེ་ནས་དེའི་ཚེ་རིགས་ཀྱི་བུ་དེ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ།
en: At this point, the noble son entered the bodhisattvas’ absorption called showing all buddha realms

source: །རིགས་ཀྱི་བུ་དེ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་མཐོང་སྟེ།
en: As soon as the noble son settled in that way, Venerable Subhūti beheld countless, innumerable buddha realms.

source: ལ་ལར་ནི་ཉི་མ་འཆར་ཀ་ཙམ།
en: He saw that in some, the sun was just coming up.

source: ལ་ལར་ནི་ཉི་མ་བག་དྲོས་ཙམ།
en: In some, the sun’s heat was just beginning to be felt.

source: ལ་ལར་ནི་དྲོས་བུ་ཆུང་ཙམ།
en: In some, it was early morning.

source: ལ་ལར་ནི་སྔ་དྲོ་ཕྱེད་ཙམ།
en: In some, it was midmorning.

source: ལ་ལར་ནི་དྲོ་ལ་བབ་ཏུ་ཉེ་བའི་དུས་ཙམ།
en: In some, it was approaching midday.

source: ལ་ལར་ནི་གཎྜཱི་རྡུང་བའི་དུས་ཙམ།
en: In some, it was time for the gaṇḍī to be sounded.

source: ལ་ལར་ནི་སྔ་མ་བཀད་པ་ཙམ།
en: In some, it was time for the early adjournment.

source: ལ་ལར་ནི་བཀད་ཟིན་པ་ཙམ། ལ་ལར་ནི་ཟན་ཟ་ཞིང་འདུག་པ་ཙམ།
en: In some, the adjournment had just been completed. In some, it was time to sit and eat.

source: ལ་ལར་ནི་ལྡང་བ་ཙམ།
en: In some, it was time to get up.

source: ལ་ལར་ནི་ལྷུང་བཟེད་འཁྲུ་བ་ཙམ།
en: In some, it was time to clean one’s alms bowl.

source: ལ་ལར་ནི་ཕྱེད་ཡོལ་གྱི་དུས་ཙམ།
en: In some, it was early afternoon.

source: ལ་ལར་ནི་ཕྱེམ་རེད་ཀྱི་དུས་ཙམ།
en: In some, it was afternoon time.

source: ལ་ལར་ནི་སྲོད་ཙམ།
en: In some, it was dusk.

source: ལ་ལར་ནི་ནམ་ཕྱེད་ཙམ།
en: In some, it was midnight.

source: ལ་ལར་ནི་ནམ་ཆུང་འཁོར་ཙམ། ལ་ལར་ནི་ཟླ་བ་དང་ཉི་མ་མེད་དེ་རང་གི་འོད་དང་ལྡན་པར་མཐོང་ངོ་།
en: In some, it was predawn. In some, there was no moon or sun, but rather an intrinsic radiance.

source: །དེ་ནས་རིགས་ཀྱི་བུ་དེས་གནས་བརྟན་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་ཁྱོད་དུས་ཚོད་གང་གི་ཚེ་བཤོས་གསོལ།
en: “Honorable Subhūti,” said the noble son to the elder Subhūti, “at what time do you take food?

source: དུས་ཚོད་ནི་ཇི་ཙམ་དུ་གདའ།
en: About what time is it now?”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་བདག་ནི་འདི་ཉིད་ཀྱི་དུས་ཚོད་ལ་ཟན་ཟའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་གྱི་དུས་ཚོད་ལ་མ་ཡིན་ནོ།
en: “Noble son,” said Subhūti, “I eat at this very time, but not at the times in the other buddha realms.”

source: །དེ་ནས་རིགས་ཀྱི་བུ་དེས་དེའི་ཚེ་ཉི་མའི་དཀྱིལ་འཁོར་ནུབ་ཕྱོགས་སུ་སོང་བ་དེ་སྔ་དྲོའི་ཕྱེད་ཙམ་དུ་བཞག་སྟེ།
en: Then that noble son moved the orb of the sun, which had by now moved to its afternoon position, back to its midmorning position.

source: ཅི་ནས་སྔ་དྲོའི་ཕྱེད་ཙམ་དུ་འཛིན་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུས་བྱས་སོ། །དེ་ནས་རིགས་ཀྱི་བུ་དེས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Through such a miraculous display, he was able to arrest the sun at its midmorning position.

source: །བཙུན་པ་རབ་འབྱོར་དུས་ཚོད་ཇི་ཙམ་ལ་བབ་པ་གཟིགས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་མཐོང་ནས་ཡིད་ཆེས་ཏེ་མི་རིང་བར་གྱུར་ཏོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་རིགས་ཀྱི་བུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Honorable Subhūti,” said the noble son to Venerable Subhūti, “now see what time it has become.” Venerable Subhūti saw and believed, and he was no longer hasty.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་མིང་ཅི་ཡིན་བདག་ལ་སྟོན་ཅིག །རིགས་ཀྱི་བུ་དེས་སྨྲས་པ།
en: “Noble son,” he asked, “tell me, what is your name?”

source: བཙུན་པ་རབ་འབྱོར་ཁྱོད་ལ་བདག་གི་མིང་གིས་ཅི་ཞིག་བགྱི།
en: “Honorable Subhūti,” replied the noble son, “what is my name to you?

source: །ཡང་ན་དེ་བཞིན་གཤེགས་པ་ཉིད་ལ་ཞུས་ཤིག་དང་དེ་ཁྱོད་ལ་ལན་འདེབས་སོ།
en: Or, ask the Thus-Gone One himself, and he will answer you.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་མིང་ཐམས་ཅད་ནི་མིང་མ་མཆིས་པའོ།
en: Moreover, honorable Subhūti, all names are non-names.

source: མིང་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པ་དང་། ཡང་དག་པ་མ་ལགས་པ་སྟེ།
en: Because all names are imputations and inauthentic.

source: གང་ཀུན་བརྟགས་པ་དང་། ཡང་དག་པ་མ་ལགས་པ་དེ་ལ་མིང་འདི་ཞེས་ཇི་སྐད་བགྱི།
en: So how can one say, ‘Its name is this ,’ with respect to what is imputed and inauthentic?”

source: བཙུན་པ་རབ་འབྱོར་གྱིས་སྨྲས་པ། ཅི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མིང་གང་ཡིན་པ་དེ་ཡང་ཀུན་བརྟགས་པ་དང་། ཡང་དག་པ་མ་ཡིན་པ་ཡིན་ནམ། སྨྲས་པ།
en: Honorable Subhūti asked, “Is the name omniscience itself also imputed and inauthentic?”

source: བཙུན་པ་རབ་འབྱོར་དེ་ནི་དེ་བཞིན་ཏེ།
en: “Indeed, honorable Subhūti.

source: འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ན་མིང་ཕན་ཚུན་ཐ་དད་པ་མ་མཆིས་པའི་སླད་དུའོ། །སྨྲས་པ།
en: Because omniscience also has various names in different buddha realms.”

source: རིགས་ཀྱི་བུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མིང་ཐ་དད་པ་ཇི་ལྟ་བུ་ཡིན། སྨྲས་པ།
en: “Noble son, these various names of omniscience—what are they like?”

source: བཙུན་པ་རབ་འབྱོར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ལ་ལར་ནི་མཐུ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་སྡུད་པ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་ཐམས་ཅད་དུ་སྣང་བ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་དྲི་མ་མེད་པ་ཞེས་བགྱིའོ།
en: “In some buddha realms, honorable Subhūti, omniscience is called power

source: །ལ་ལར་ནི་དོན་ཐམས་ཅད་སྟོན་པ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་ཉམས་པ་མེད་པ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་མཆོད་པ་པོ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་མངོན་སུམ་པ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་བྱི་རུ་འཛིན་ཅེས་བགྱིའོ། །ལ་ལར་ནི་རྣམ་པར་རྒྱལ་བ་ཆེན་པོ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་སྒྲ་ཆེན་པོ་ཞེས་བགྱིའོ། །ལ་ལར་ནི་དཔག་ཏུ་མ་མཆིས་པ་ཞེས་བགྱི་སྟེ།
en: In some it is called gathering , in some illumination of all , in some stainless , in some teaching all meanings , in some without degeneration , in some making offerings , in some directly perceiving , in some holding coral , in some great victory , in some great sound , and in some boundless

source: བཙུན་པ་རབ་འབྱོར་དེ་ལྟར་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ན་མིང་ཐ་དད་པ་དཔག་ཏུ་མ་མཆིས་སོ།
en: In this way, honorable Subhūti, the various names for omniscience in different buddha realms cannot be fathomed.

source: །དེ་བཞིན་དུ་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའི་མིང་ཐ་དད་པ་ཡང་དཔག་ཏུ་མ་མཆིས་སོ།
en: Similarly, the various names for form, feeling, perception, formation, and consciousness cannot be fathomed either.

source: །དེ་བཞིན་དུ་ཕུང་པོ་རྣམས་དང་། ཁམས་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ན་མིང་ཐ་དད་པ་དཔག་ཏུ་མ་མཆིས་ཏེ།
en: Likewise, the various names in different buddha realms for the aggregates, elements, sense sources, applications of mindfulness, authentic exertions, bases of miraculous power, faculties, powers, branches of awakening, and the eight branches of the path of the noble ones also cannot be fathomed.

source: དེ་བས་ན་བཙུན་པ་རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་མིང་ཐམས་ཅད་ནི་མིང་མ་མཆིས་པ་དང་། ཀུན་བརྟགས་པ་དང་། ཡང་དག་པ་མ་ལགས་པ་དེ་ལྟར་རིག་པར་བགྱིའོ།
en: That being so, honorable Subhūti, through this explanation you should understand that all names are non-names, and that they are imputed and inauthentic in this way.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་རིགས་ཀྱི་བུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོའི་ཁབ་ཀྱི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ནི་དེ་ན་ཡོན་གནས་འདི་ལྟ་བུ་དག་འཁོད་པ་ལས་ན་རྙེད་པ་ལེགས་པར་རྙེད་པ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་དེས་སྨྲས་པ།
en: Then Venerable Subhūti said to the noble son, “Through the presence here of such beings worthy of offerings, the priests and householders of Rājagṛha have encountered fortunate circumstances.”

source: བཙུན་པ་རབ་འབྱོར་འཇིག་རྟེན་ན་ཡོན་གནས་གང་ལགས་པ་མཁྱེན་ཏམ། སྨྲས་པ།
en: “Honorable Subhūti,” asked the noble son, “do you know what characterizes beings worthy of offerings in the world?”

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་བདག་གིས་སྤོབས་པ་དེ་བཞིན་དུ་བསྟན་པར་བྱ་སྟེ།
en: “I will explain, son of noble family, to the extent that I am confident to do so.

source: ཚུལ་ཁྲིམས་དང་ལྡན་པ། དགེ་བའི་ཆོས་ལ་ཞུགས་པ། སེམས་འཁྲུལ་པ་མེད་པ་གང་ཡིན་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ཡིན་ནོ། །སྨྲས་པ།
en: Those who observe discipline, who engage in virtue, and whose minds are without confusion are beings worthy of offerings in the world.”

source: བཙུན་པ་རབ་འབྱོར་ཁྱོད་ཀྱིས་ཇི་སྐད་བསྟན་པ་དེ་དག་ནི་ཡོན་གནས་ཡོངས་སུ་རྫོགས་པ་མ་ལགས་སོ། །སྨྲས་པ།
en: “Honorable Subhūti, those you have described are not perfect objects of offerings.”

source: རིགས་ཀྱི་བུ་ཡོན་གནས་ཡོངས་སུ་རྫོགས་པ་ཇི་ལྟ་བུ་ཡིན།
en: “Noble son, then what are perfect objects of offerings like?”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡང་སྐྱེ་ལ་སེམས་ཅན་གང་ཡང་མི་དམིགས་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ལགས་སོ།
en: “Honorable Subhūti, those in whom great love and great compassion for all beings has arisen, but who do not observe any being whatsoever, are worthy of offerings in the world.

source: །སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱི་ཚུལ་མི་གཅོད་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ལགས་སོ།
en: Those who do not interrupt the way of the Buddha, Dharma, and Saṅgha are worthy of offerings in the world.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བ་ལ་བརྩོན་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ལགས་སོ།
en: Those who endeavor to eliminate the afflictions of all beings are worthy of offerings in the world.

source: །ཡེ་ཤེས་མི་ཟད་པ་དང་། ཤེས་རབ་མི་ཟད་པ་དང་། བསོད་ནམས་མི་ཟད་པ་དང་། སྤོབས་པ་མི་ཟད་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ལགས་སོ།
en: Those who have inexhaustible wisdom, inexhaustible knowledge, inexhaustible merit, and inexhaustible eloquence are worthy of offerings in the world.

source: །སོ་སོའི་སྐྱེ་བོའི་གྲོགས་མི་བགྱིད་ལ་འཕགས་པའི་གྲོགས་བགྱིད་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ལགས་སོ།
en: Those who do not associate with ordinary beings, but rather with noble ones, are worthy of offerings in the world.

source: །གང་དག་མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་ཡེ་ཤེས་མཐོང་བ་རྣམ་པར་དག་པར་འགྱུར་བ་གང་དག་ལགས་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་ཡོན་གནས་ལགས་སོ།
en: Those completely pure individuals who see the wisdom of beings, merely by seeing those beings, are worthy of offerings in the world.”

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱི་ཕྱི་བཞིན་དུ་རྟག་ཏུ་འབྲང་བའི་ལྷ་ངེས་པ་ལ་མ་ཞུགས་པ་གང་ཡིན་པ་དེས་ཡོན་གནས་ཀྱིས་བསྟན་པ་འདི་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: At the time, there was a god who had constantly followed the elder Subhūti, but without gaining certainty. Hearing this teaching on those who are worthy of offerings, he gave rise to the mind intent upon unsurpassed and perfect awakening.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཟོད་པ་གསོལ་ཏེ།
en: He prostrated at the feet of Venerable Subhūti and begged his pardon, saying, “Honorable Subhūti, I will no longer follow you.”

source: བཙུན་པ་རབ་འབྱོར་བ་དག་ཁྱོད་ཀྱི་སླད་བཞིན་དུ་འབྲང་བར་མི་བགྱིད་དོ་ཞེས་བྱས་སོ། །དེ་ནས་རིགས་ཀྱི་བུ་དེས་ལྷ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་ཁྱོད་ཅིའི་ཕྱིར་བཙུན་པ་རབ་འབྱོར་ལ་བཟོད་པ་གསོལ།
en: “Celestial being, why are you begging pardon of honorable Subhūti?” inquired the noble son.

source: སྨྲས་པ། རིགས་ཀྱི་བུ་བདག་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་བཙུན་པ་རབ་འབྱོར་གྱི་ཕྱི་བཞིན་འབྲངས་ཀྱང་།
en: “Noble son, I have followed honorable Subhūti for twelve years.

source: བདག་གིས་ཡོན་གནས་ཀྱིས་བསྟན་པ་འདི་ལྟ་བུ་སྔོན་ཆད་མ་ཐོས་ཏེ།
en: Yet never before have I heard such a teaching about those who are worthy of offerings.

source: དེ་བས་ན་ད་ལྟར་ཡོན་གནས་ཀྱིས་བསྟན་པ་འདི་ཐོས་ནས་བདག་གི་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་བདག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: For that reason, as I heard this teaching about those who are worthy of offerings, I formed a good motivation and gave rise to the mind set upon unsurpassed and perfect awakening.

source: གང་དང་གང་ན་ཡོན་གནས་ཀྱིས་ཡོངས་སུ་དག་པར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྡུད་པར་བྱེད་པའི་ཆོས་འདི་ལྟ་བུ་དག་ཐོས་པར་འགྱུར་བ་དེ་དང་དེར་འགྲོའོ་སྙམ་མོ།
en: Thus, I now think that I should go anywhere I can to hear such teachings that gather bodhisattvas who exemplify the pure state of those worthy of offerings.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལྷ་དེའི་སེམས་བསྐྱེད་པ་དེ་ལ་རྗེས་སུ་ཡི་རངས་ནས་ལྷ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་ཁྱོད་ཀྱི་སེམས་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་དག་ལ་བཏུད་པ་དེ་ནི་རྙེད་པ་ལེགས་པར་རྙེད་དོ།
en: Venerable Subhūti rejoiced that the god had given rise to such a motivation, and said to him, “Celestial being, you have found something excellent in mentally bowing down to the vast qualities of the Buddha.

source: །ལྷ་བདག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སེམས་སྣད་པར་གྱུར་ཏེ།
en: My mind, celestial being, has been injured with respect to omniscience.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་དུ་མ་གྱུར་པས་ཅི་བྱར་ཡང་མེད་དོ།
en: Now, since I am not a suitable vessel for the qualities of the Buddha, there is nothing that can be done.

source: །ལྷ་གལ་ཏེ་བདག་སེམས་རྣམ་པར་གྲོལ་བར་མ་གྱུར་ན་ནི་བདག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཞིག་མོད།
en: Celestial being, since my mind is not liberated, I too should surely give rise to the mind set upon unsurpassed and perfect awakening.

source: ལྷ་གཞན་ཡང་ཁྱོད་ཀྱིས་ནི་སྔོན་མ་ཐོས་པའི་ཆོས་རྣམས་ཐོས་པར་བྱེད་པ་དང་། ཐོས་པ་རྣམས་ཀྱང་ཆུད་མི་ཟ་བར་བྱེད་པའི་སྐྱེས་བུ་དམ་པ་འདི་ཅི་འདྲ་བ་དེ་ལྟ་བུའི་དགེ་བའི་བཤེས་གཉེན་ལ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་བསྟེན་པར་བྱའོ།
en: Furthermore, celestial being, I should constantly and uninterruptedly attend to a spiritual friend, just like the holy being who is causing you to hear Dharma teachings you have not heard before and not allowing those you have heard to go to waste.”

source: །དེ་ནས་རིགས་ཀྱི་བུ་དེས་ལྷ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་འགྲུབ་པར་དཀའ་སྟེ།
en: Then the noble son said to the god, “Unsurpassed and perfect awakening is difficult to attain, celestial being.

source: དེ་ནི་གོ་ཆ་ངན་ངོན་ཙམ་གྱིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ།
en: One does not fully awaken merely by means of the most basic preparations.”

source: །ལྷས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འགྲུབ་པར་དཀའ་བ་ཡིན་མོད་ཀྱི།
en: “Holy being,” replied the god, “unsurpassed and perfect awakening is indeed difficult to attain.

source: འོན་ཀྱང་ཅི་ནས་བདག་གིས་བཙལ་བ་དོན་ཡོད་པར་འགྱུར་བར་བདག་གིས་བསྒྲུབ་པར་བྱའོ། །སྨྲས་པ།
en: Nevertheless, I will, by any means, make my search meaningful and accomplish it.”

source: ལྷ་ཁྱོད་ཀྱིས་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: “How will you accomplish this, celestial being?”

source: སྨྲས་པ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཉོན་མོངས་པ་ལས་རབ་ཏུ་གྲོལ་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕུང་པོའི་ཁུར་ཁྱེར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སྡུག་བསྔལ་ཐམས་ཅད་རྟོགས་པར་བྱ་བའི་ཕྱིར་དེ་ལྟར་བསྒྲུབ་པར་བྱའོ།
en: “I will accomplish it by being impartial toward all beings, by liberating all beings from afflictions, by taking on the burden of the aggregates of all beings, by bringing all beings to maturity, and by understanding all suffering.”

source: །རིགས་ཀྱི་བུ་དེས་སྨྲས་པ། ལྷ་སེམས་ཅན་དུ་འདུ་ཤེས་པ་ལ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་མེད་དོ།
en: “Celestial being,” replied the noble son, “for one who conceives of beings, there is no impartiality toward all beings.

source: །ཉོན་མོངས་པར་འདུ་ཤེས་པ་ལ་ནི་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་གྲོལ་བར་བྱེད་པ་མེད་དོ། །ཕུང་པོར་འདུ་ཤེས་པ་ལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕུང་པོའི་ཁུར་ཁྱེར་བ་མེད་དོ།
en: For one who conceives of afflictions, there is no liberating all beings. For one who conceives of aggregates, there is no taking on the burden of the aggregates of all beings.

source: །ཀུན་བརྟགས་པའི་དགེ་བའི་རྩ་བ་ཅན་ལ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མེད་དོ།
en: For one who imputes roots of virtue, there is no bringing beings to maturity.

source: །བདག་དང་གཞན་དུ་འདུ་ཤེས་པ་ལ་ནི་སྡུག་བསྔལ་ཐམས་ཅད་རྟོགས་པར་བྱེད་པ་མེད་དོ།
en: For one who conceives of self and other, there is no understanding of all suffering.”

source: །དེ་ནས་ལྷ་དེ་གདམས་ངག་འདི་བསྟན་པས་འཐུན་པའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་བོ།
en: At that point, through the teaching of these oral instructions, the god attained acceptance with respect to all the concordant teachings.

source: །དེ་ནས་ལྷ་དེས་རིགས་ཀྱི་བུ་དེ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་སྒོ་གང་དེར་ལྷའི་མེ་ཏོག་སིལ་མས་གཏོར་ཏོ།
en: Then, in order to venerate the noble son, the god scattered celestial flowers at the gate.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ལྷ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་བདག་གིས་ཁྱོད་ཀྱི་བསམ་པ་མ་ཤེས་ནས་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ཀྱི་གཏམ་བྱས་ཏེ་དགའ་བ་སྐྱེད་པ་དེ་ཁྱོད་ཀྱིས་ཀྱང་བཟོད་པ་གྱིས་ཤིག །དེ་ནས་ལྷ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Next, Venerable Subhūti spoke to the god, saying, “Celestial being, I beg your pardon as well, for having delighted in giving Dharma teachings of the hearers without being aware of your motivation.”

source: །བཙུན་པ་རབ་འབྱོར་ཁྱོད་ལ་བདག་ཕྱག་འཚལ་གྱིས་སེམས་ཅན་སུའི་ཚོད་ཀྱང་མ་འཛིན་ཅིག །སེམས་ཅན་སུ་ལ་ཡང་རུང་སྟེ་བསམ་པ་མ་བརྟགས་པར་ཆོས་མ་འཆད་ཅིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Honorable Subhūti,” responded the god, “although I prostrate to you, do not limit any sentient being. Do not teach the Dharma to any sentient being, whoever they are, without first investigating their motivation. And what is the reason for that?

source: བཙུན་པ་རབ་འབྱོར་མ་ཐོས་པ་ནི་སླའི་བྱང་ཆུབ་འདོད་པས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཐོས་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Honorable Subhūti, for one who longs for awakening, it would be better not to have heard anything than to have listened to teachings belonging to the Hearers’ Vehicle.

source: །བཙུན་པ་རབ་འབྱོར་ཡུན་རིང་དུ་བཀྲེས་པ་ནི་སླའི་ཁ་ཟས་དུག་དང་འདྲེས་པ་ཟོས་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: It would be better, honorable Subhūti, for someone to have gone hungry for a long time than to have eaten food mixed with poison.

source: །བཙུན་པ་རབ་འབྱོར་དེ་བཞིན་དུ་མ་ཐོས་པ་ནི་སླའི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པས་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཐོས་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Similarly, honorable Subhūti, for one who belongs to the Bodhisattvas’ Vehicle, it would be better not to have heard anything than to have listened to the teachings of the Hearers’ Vehicle.”

source: །དེ་ནས་རིགས་ཀྱི་བུ་དེས་ཡང་བུད་མེད་ཀྱི་གཟུགས་དང་། ཁ་དོག་སྔ་མ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བསྟན་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བདག་གིས་བསོད་སྙོམས་མ་ཕུལ་གྱི་བར་དུ་རེ་ཞིག་གཞེས་ཤིག །དེ་ནས་བུད་མེད་དེ་རང་གི་ཁྱིམ་དུ་སོང་སྟེ།
en: Then the noble son once again took on a female appearance and complexion, just like before, and said to Venerable Subhūti, “Please wait for a moment, honorable Subhūti, until I offer you alms.”

source: རོ་བརྒྱ་དང་ལྡན་པའི་ཟས་བླངས་ནས་ཕྱིར་བྱུང་སྟེ།
en: The lady entered her home, assembled some delicious food, and returned outside.

source: འོངས་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: She then said to Venerable Subhūti, “Partake of these alms, honorable Subhūti, but do not do so in a way that involves passion. Nor in a way that is divorced from passion. Do not do so in a way that involves aggression. Neither do so in a way that is divorced from aggression.

source: །བཙུན་པ་རབ་འབྱོར་བསོད་སྙོམས་འདི་བཞེས་ལ་འདོད་ཆགས་དང་བཅས་པར་ཡང་མ་མཛད་ཅིག །འདོད་ཆགས་དང་བྲལ་བར་ཡང་མ་མཛད་ཅིག །ཞེ་སྡང་དང་བཅས་པར་ཡང་མ་མཛད་ཅིག །ཞེ་སྡང་དང་བྲལ་བར་ཡང་མ་མཛད་ཅིག །གཏི་མུག་དང་བཅས་པར་ཡང་མ་མཛད་ཅིག །གཏི་མུག་དང་བྲལ་བར་ཡང་མ་མཛད་ཅིག །ཉོན་མོངས་པ་དང་བཅས་པར་ཡང་མ་མཛད་ཅིག །ཉོན་མོངས་པ་དང་བྲལ་བར་ཡང་མ་མཛད་ཅིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་སྡུག་བསྔལ་ཡོངས་སུ་མ་མཁྱེན།
en: Do not do so in a way that involves delusion. Neither do so in a way that is divorced from delusion. Do not do so in a way that involves afflictions. Neither do so in a way that is divorced from afflictions. “If honorable Subhūti has not understood suffering, has not relinquished its origin, has not actualized cessation, and has not cultivated the path, then, in that case, partake of these alms.

source: ཀུན་འབྱུང་བ་མ་སྤངས། འགོག་པ་མངོན་སུམ་དུ་མ་བགྱིས། ལམ་མ་བསྒོམས་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་མ་བསྒོམས། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མ་བསྒོམས་ན།
en: If honorable Subhūti has not cultivated the four applications of mindfulness, and has not cultivated the four authentic exertions, four bases of miraculous power, five faculties, five powers, seven branches of awakening, and eight branches of the path of the noble ones, then, in that case, partake of these alms. If honorable Subhūti has also not disturbed the transitory collection and if he has attained the path that has a sole destination, then, in that case, partake of these alms. “If honorable Subhūti has experienced liberation through knowing without destroying ignorance; if he has experienced the unconditioned without bringing about the exhaustion of the conditioned;

source: དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་འཇིག་ཚོགས་ཀྱང་མ་དཀྲུགས་ལ་བགྲོད་པ་གཅིག་པའི་ལམ་ཡང་ཐོབ་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་མ་རིག་པ་མ་བཤིག་པར་རིག་པས་རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་མཛད་པ་དང་། འདུ་བྱེད་ཟད་པར་མ་མཛད་པར་འདུས་མ་བྱས་མངོན་སུམ་དུ་མཛད་པ་དང་། རྣམ་པར་ཤེས་པའི་རྒྱུ་བ་ལ་མ་བརྟེན་པར་རྣམ་པར་གྲོལ་བར་གྱུར་པ་དང་། མིང་དང་གཟུགས་སུ་སྒྲོ་མ་བཏགས་པར་ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདས་པ་དང་། སྐྱེ་མཆེད་དྲུག་ལ་མ་བརྟེན་པར་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་བསྒོམས་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་ལ་མ་བརྟེན་པར་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པ་བསྒོམས་པ་དང་། ཚོར་བ་མ་དམིགས་པར་རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པ་མངོན་སུམ་དུ་མཛད་པ་དང་། སྲེད་པ་མི་དམིགས་པར་དེ་བཞིན་ཉིད་ཡོངས་སུ་མཁྱེན་པ་དང་། ལེན་པ་རློམ་སེམས་སུ་མ་མཛད་པར་ལེན་པ་མེད་པ་ཀུན་མཁྱེན་པ་དང་། སྲིད་པ་མི་འབྱུང་བའི་ཚུལ་དུ་ཡོངས་སུ་མཁྱེན་པ་དང་། སྐྱེ་བ་མི་སྐྱེ་བར་ཡོངས་སུ་མཁྱེན་པ་དང་། རྒ་ཤི་བརྗོད་དུ་མེད་པའི་ཚུལ་དུ་ཡོངས་སུ་མཁྱེན་པ་དེ་ལྟ་བུར་སྲིད་པའི་ཡན་ལག་རྣམས་ཀུན་མཁྱེན་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་སངས་རྒྱས་ཀྱང་མ་གཟིགས།
en: if he has been liberated without relying on the movement of consciousness; if he has transcended the three realms without forming concepts regarding name and form; if he has meditated on emptiness, which is a gateway to liberation, without indulging in the six sense sources; if he has meditated on the absence of signs, which is a gateway to liberation, without indulging in visual contact; if he has directly experienced the absence of wishes, which is a gateway to liberation, without focusing on sensation;

source: ཆོས་ཀྱང་མ་གསན།
en: if he has realized suchness without focusing on craving; if he has understood the entirety of the absence of grasping without any thoughts of grasping;

source: དགེ་འདུན་ལ་ཡང་མི་རྟོན་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་འཕགས་པའི་མཉམ་པ་ཉིད་ཀྱིས་སོ་སོའི་སྐྱེ་བོ་མཉམ་པ་ཉིད་དུ་ཡོངས་སུ་མཁྱེན་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་ཉིད་འདི་ནས་ཀྱང་མེད་པར་གྱུར་ལ་ཕ་རོལ་ཏུ་ཡང་མི་སྐྱེ་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་མཉམ་པ་ཉིད་ཀྱིས་ཉོན་མོངས་པ་མེད་པ་མཉམ་པ་ཉིད་དུ་ཡོངས་སུ་མཁྱེན་ལ།
en: if he has understood existence without anything arising; if he has realized birth as non-birth; if he has realized old age and death to be ineffable; and if he has realized all the links of existence to be like this, then, in that case, partake of these alms. “If honorable Subhūti has not beheld the Buddha, nor heard the Dharma, nor relied upon the Saṅgha, then, in that case, partake of these alms.
